// Напишите программу которая проинимает на вход число N и выдает произведение чисел от 1 до N
Console.WriteLine("Hello, World!");
