// Напишите программу которая принимает число (А), и выдает сумму чисел от 1 до А
Console.WriteLine("Hello, World!");
